**EDA on Insurance Dataset**

In [169]:
#Importing pandas
import pandas as pd

In [170]:
#Importing the dataset
df=pd.read_csv('insurance.csv')
df.head()

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900       0.0    yes  southwest  16884.92400
1  18.0    male  33.770       1.0     no  southeast   1725.55230
2  28.0    male  33.000       3.0     no  southeast   4449.46200
3  33.0    male  22.705       0.0     no  northwest  21984.47061
4  32.0    male  28.880       0.0     no  northwest   3866.85520

In [171]:
#Info about dataset
df.info

<bound method DataFrame.info of        age     sex     bmi  children smoker     region      charges
0     19.0  female  27.900       0.0    yes  southwest  16884.92400
1     18.0    male  33.770       1.0     no  southeast   1725.55230
2     28.0    male  33.000       3.0     no  southeast   4449.46200
3     33.0    male  22.705       0.0     no  northwest  21984.47061
4     32.0    male  28.880       0.0     no  northwest   3866.85520
...    ...     ...     ...       ...    ...        ...          ...
1333  50.0    male  30.970       3.0     no  northwest  10600.54830
1334  18.0  female  31.920       0.0     no  northeast   2205.98080
1335  18.0  female  36.850       0.0     no  southeast   1629.83350
1336  21.0  female  25.800       0.0     no  southwest   2007.94500
1337  61.0  female  29.070       0.0    yes  northwest  29141.36030

[1338 rows x 7 columns]>

In [172]:
#Description of the dataset
df.describe

<bound method NDFrame.describe of        age     sex     bmi  children smoker     region      charges
0     19.0  female  27.900       0.0    yes  southwest  16884.92400
1     18.0    male  33.770       1.0     no  southeast   1725.55230
2     28.0    male  33.000       3.0     no  southeast   4449.46200
3     33.0    male  22.705       0.0     no  northwest  21984.47061
4     32.0    male  28.880       0.0     no  northwest   3866.85520
...    ...     ...     ...       ...    ...        ...          ...
1333  50.0    male  30.970       3.0     no  northwest  10600.54830
1334  18.0  female  31.920       0.0     no  northeast   2205.98080
1335  18.0  female  36.850       0.0     no  southeast   1629.83350
1336  21.0  female  25.800       0.0     no  southwest   2007.94500
1337  61.0  female  29.070       0.0    yes  northwest  29141.36030

[1338 rows x 7 columns]>

In [173]:
#Checking for columns with null values
df.columns[df.isnull().any()]

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [174]:
#Checking the frequency of null values
print("Null value count across the dataset")
df.isnull().sum()

Null value count across the dataset

age         26
sex         66
bmi         75
children    82
smoker      59
region      51
charges     23
dtype: int64

In [175]:
#Row with null values before null value elimination
df.loc[78]

age                NaN
sex                NaN
bmi                NaN
children           NaN
smoker             NaN
region       northeast
charges     2755.02095
Name: 78, dtype: object

*Using the Column Median method to replace the null values in columns with continous data*

In [176]:
#Getting the columns with continious data
numeric_cols = df._get_numeric_data().columns
numeric_cols_range  = numeric_cols.size
print(numeric_cols)
print(numeric_cols_range)

Index(['age', 'bmi', 'children', 'charges'], dtype='object')
4

In [177]:
#Defining a function for filling null values in these columns with their median values
def replace_med(col):
  df[col].fillna(df[col].median(),inplace=True)

In [178]:
#Calling the function on each of the numeric columns
for i in range(numeric_cols_range):
    replace_med(numeric_cols[i])

In [179]:
print("Null values in the numeric columns")
for i in range(numeric_cols_range):
    print(numeric_cols[i],": ",df[numeric_cols[i]].isnull().sum())

Null values in the numeric columns
age :  0
bmi :  0
children :  0
charges :  0

*Using the Column Mode method to replace the null values in columns with categorical data*

In [180]:
#Getting the columns with the categorical data
cat_cols = df.select_dtypes(include=['object']).columns.tolist()
print(cat_cols)

['sex', 'smoker', 'region']

In [181]:
#Defining a function to replaces the null values with mode of the columns
def replace_mode(col):
  df[col].fillna(value=df[col].mode()[0], inplace=True)

In [182]:
#Calling the function on the categorical columns
for i in range(len(cat_cols)):
  replace_mode(cat_cols[i])

In [183]:
print("Null values in the categorical columns")
for i in range(len(cat_cols)):
    print(cat_cols[i],": ",df[cat_cols[i]].isnull().sum())

Null values in the categorical columns
sex :  0
smoker :  0
region :  0

*Final test after null values are removed*

In [184]:
#Checking the null values in the whole dataset now
print("Null value count across the dataset")
df.isnull().sum()

Null value count across the dataset

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [185]:
#Row with null values after null value elimination
df.loc[78]

age               39.0
sex               male
bmi               30.4
children           1.0
smoker              no
region       northeast
charges     2755.02095
Name: 78, dtype: object